[
    {"title":"Security",
    "description":"Security is a course which studies the core security principles and requirements, and we will investigate the main pitfalls in system and software design (vulnerabilities) and the established techniques to ensure security (defenses). We will approach security at different levels: from basic cryptographic schemes and software vulnerabilities to secure systems and security in organizations.",
    "teachers":["og"],
    "links":[
        {"label":"2022-2023",
        "link":"https://studiegids.universiteitleiden.nl/courses/114214/security"},
        {"label":"2021-2022",
        "link":"https://studiegids.universiteitleiden.nl/courses/109140/security"},
        {"label":"2020-2021",
        "link":"https://studiegids.universiteitleiden.nl/courses/103279/security"}

    ]},

    {"title":"Introduction to Cyber Security",
    "description":"Introduction to Cyber Security is a course designed to provide students with a fundamental understanding of cybersecurity. The course will introduce students to the key principles of cybersecurity, including confidentiality, integrity, and availability, and will explore the risks and threats associated with the digital world. This course is intended for mostly non-technical students who are interested in learning how to protect themselves and their data from cyber threats. Students will learn about various cyber attacks and how to recognize and respond to them, as well as basic cybersecurity tools and techniques. By the end of the course, students will have a basic understanding of cybersecurity concepts and be better equipped to protect themselves and their organizations from cyber threats.",
    "teachers":["og","nds"],
    "links":[
        {"label":"2022-2023",
        "link":"https://studiegids.universiteitleiden.nl/courses/111484/introduction-to-cyber-security"},
        {"label":"2021-2022",
        "link":"https://studiegids.universiteitleiden.nl/courses/106016/introduction-to-cyber-security"},
        {"label":"2020-2021",
        "link":"https://studiegids.universiteitleiden.nl/courses/103492/introduction-to-cyber-security"}

    ]},
    {"title":"Basic Programming in Python",
    "description":"Basic Programming in Python is a course designed to provide students with a foundational understanding of Python programming language. The course is intended for mostly non-technical students who are interested in learning programming in Python. Students will learn the basic syntax, data structures, and control flow constructs of the Python programming language. The course will cover topics such as variables, data types, operators, conditional statements, loops, functions, and file I/O. Through hands-on coding exercises, students will learn how to write simple Python programs to solve real-world problems. By the end of the course, students will have an understanding of Python programming and be able to write simple Python programs on their own.",
    "teachers":["og","nds"],
    "links":[
        {"label":"2022-2023",
        "link":"https://studiegids.universiteitleiden.nl/courses/111481/basic-programming-in-python"},
        {"label":"2021-2022",
        "link":"https://studiegids.universiteitleiden.nl/courses/106019/basic-programming-in-python"}
    ]},
    {"title":"System and Software Security",
    "description":"The first part of the course will focus on vulnerabilities and their detections at the software level. We will overview the most important code vulnerability types and will study the state-of-the-art techniques for identifying security issues at the software level, e.g., fuzzing, static and dynamic security analysis. We will also review the secure software development lifecycle.</p><p>The second part of the course covers attacks and protection mechanisms that specifically focus on the hardware of computer systems. We will study vulnerabilities in the computer architecture and the memory, as well as hardware-based roots of trust and security architectures.",
    "teachers":["og"],
    "links":[
        {"label":"2022-2023",
        "link":"https://studiegids.universiteitleiden.nl/courses/114109/system-and-software-security"},
        {"label":"2021-2022",
        "link":"https://studiegids.universiteitleiden.nl/courses/105165/system-and-software-security"}
    ]},

    {"title":"Cyber Security",
    "description":"The aim of this course is: To provide broad, managerial insight on how to set up and manage an ICT security function within a (large) company; To provide enough knowledge to be a credible sparring partner for ICT security specialists; To provide insight in “the human factor as the weakest link” within ICT security; To learn from hands-on ICT security specialist how attacks take place, and how to defend against them – pro-actively but also re-actively.",
    "teachers":["og"],
    "links":[
        {"label":"2022-2023",
        "link":"https://studiegids.universiteitleiden.nl/courses/114099/cyber-security"},
        {"label":"2021-2022",
        "link":"https://studiegids.universiteitleiden.nl/courses/105127/cyber-security"},
        {"label":"2020-2021",
        "link":"https://studiegids.universiteitleiden.nl/courses/102197/cyber-security"}
    ]},
    {"title":"Case Studies in Cyber Security",
    "description":"Whereas in modules Measures and Interventions and Network Security of the technical track attention was paid to the characteristics of ICT systems, types of attacks and possible security measures, the main aim of this course is that students translate and apply their theoretical/technical knowledge in specific case studies. Case studies will be related to mobile system security, SOC operations and security monitoring, threat modelling, data integrity in the cloud, and blockchain technology. Participants will design a security architecture and analyse a system for the chosen case. They should write a primarily technical report, taking non-technical aspects and possible impact into account. In addition to the report the students should give a presentation for both staff and their colleagues.",
    "teachers":["og"],
    "links":[
        {"label":"2022-2023",
        "link":"https://studiegids.universiteitleiden.nl/courses/114354/case-studies-in-cyber-security"},
        {"label":"2021-2022",
        "link":"https://studiegids.universiteitleiden.nl/courses/109769/case-studies-in-cyber-security"},
        {"label":"2020-2021",
        "link":"https://studiegids.universiteitleiden.nl/courses/103688/case-studies-in-cyber-security"}
    ]}

]