[
    {
        "title":"ADT Kill Chain Mapping",
        "code":"adt-kcm",
        "supervisor":["nds"],
        "description":"Create a parameter that can map an ADT node to a kill chain step. Provide examples of this mapping in action. Discuss utility of such a mapping",
        "deliverable":"ADT parameter mapping. ADT examples of this. Analysis.",
        "level":"b",
        "status":"a"
    },
    {
        "title":"ADT Online Survey",
        "code":"adt-os",
        "supervisor":["nds"],
        "description":"Create a survey to be given either in-person or via crowdsourcing that seeks to understand the comprehensibility of attack trees to laypeople.",
        "deliverable":"A survey, the data from that survey, analysis of data",
        "level":"m",
        "status":"a"
    },
    {
        "title":"General Threat Communication Survey",
        "code":"gtcs",
        "supervisor":["nds"],
        "description":"Create a survey to be given either in-person or via crowdsourcing to establish what information is received when threats are communicated. How does this information change based on how the threat is communicated?",
        "deliverable":"ADT parameter mapping. ADT examples of this. Analysis.",
        "level":"m",
        "status":"a"
    },
    {
        "title":"ADT Industry Survey",
        "code":"adt-is",
        "supervisor":["nds"],
        "description":"Interview a series of people in industry who work with ADTs to find how they use them, why they use them, how they are perceived (what do they find useful), etc.",
        "deliverable":"Interview transcripts/recordings, analysis of interviews (coding)",
        "level":"m",
        "status":"a"
    },
    {
        "title":"Automated ADT Generation",
        "code":"automated-adt",
        "supervisor":["nds"],
        "description":"Write code that can take ADT input in some format: plaintext description, paragraph, structure sentences (BSc), etc, and produce an ADT directly usable format (xml/json)",
        "deliverable":"Program/algorithm capable of generated ADT format (xml/json representation) from textual input",
        "level":"b",
        "status":"a"
    },
    {
        "title": "ADT Web App User Study",
        "code": "adt-user-study",
        "supervisor": [
            "nds"
        ],
        "description": "Design and run a user study on the usability of the previously built ADT Web App tool. Find what the strengths and weaknesses of the tool are in a scientific manner.",
        "deliverable": "User study data",
        "level": "m",
        "status": "a"
    },
    {
        "title":"Automated ADT Format from Image",
        "code":"adt-from-image",
        "supervisor":["nds"],
        "description":"Write code that can take ADT image and generate a standardized ADT format from it",
        "deliverable":"Program/algorithm capable of generated ADT format (xml/json representation) from image input",
        "level":"b",
        "status":"a"
    },
    {
        "title":"ADT Dataset Creation",
        "code":"adt-dataset-creation",
        "supervisor":["nds"],
        "description":"Write code that creates a LOT of ADTs in standardized format (xml/json) from some kind of dataset (example: MITRE). This could be used for general analysis or as training data for some kind of ML project.",
        "deliverable":"Dataset of ADTs, analysis of dataset",
        "level":"b",
        "status":"a"
    },
    {
        "title":"ADT Python Library",
        "code":"adt-python-library",
        "supervisor":["nds"],
        "description":"Create a library that allows for the creation of ADTs in Python. This should include some kind of visualization, the ability to enter whole trees in standard format, and the ability to access/adjust/add onto nodes already within the ADT (needs to ability to traverse and access nodes in the Tree) ",
        "deliverable":"Python library that can generate ADTs",
        "student": "bs-jh",
        "level":"b",
        "status": "i"
    },
    {
        "title":"ADT JSON Format",
        "code":"adt-json-format",
        "supervisor":["nds"],
        "student":"bs-svp",
        "description":"Describe and define a JSON format for ADTs. Write code that will convert between the defined ADTool XML ADT format to a new defined JSON ADT format.",
        "deliverable":"Code that converts between the adtool xml and the defined json format",
        "level":"b",
        "status":"i"
    },
    {
        "title":"Measuring non-technical practices during the software development process",
        "code":"measure-non-technical-practices",
        "supervisor":["ak"],
        "description":"In spite of all efforts to improve software security, vulnerabilities are still distributed in software. While producing secure software, there are problems with not only purely technical practices but also non-technical practices, such as organizational, behavioral, and governance aspects. People, who make decisions have less understanding of non-technical practices. In this project, you will explore which non-technical practices are involved in the secure software methodologies and the methods used to provide evidence of the effectiveness of these practices.",
        "level":"b",
        "status":"a"
    },
    {
        "title": "Zero-day hunting in Github projects",
        "code": "github-zero-day-hunt",
        "supervisor": [
            "ja"
        ],
        "description": "We have a fast and new methodology to find zero-day vulnerabilities in public Github projects. With our guidance, you'll verify the existence of vulnerabilities and participate in submitting the CVEs and writing the papers. The methodology is almost ready but obvious reasons we don't publish the details here.",
        "level": "b",
        "status": "a"
    },
    {
        "title": "Studying zero-day fixes in Github",
        "code": "github-zero-day-study",
        "supervisor": [
            "ja"
        ],
        "description": "With a new methodology, you'll research on some nice results from studying zero-day fixes in Github. The methodology is almost ready but obvious reasons we don't publish the details here.",
        "level": "b",
        "status": "a"
    },
    {
        "title": "Establishing a means to collect, store, and query ADT information from a web application",
        "code": "adt-webapp-backend-server",
        "supervisor": [
            "nds"
        ],
        "student": "bs-fd",
        "description": "",
        "status": "i",
        "level": "b"
    }
]