[{"topic":"ADTs in Practice",
  "description":["Attack trees are a well-established method for modeling and analyzing potential attacks on a system or network. While attack trees have been extensively studied in academic research, it is unclear to what extent these theoretical models are used in practice, and if they are used, how they are applied and adapted to real-world scenarios. This project aims to bridge this gap."],
  "img":"https://via.placeholder.com/700x300"},
  {"topic":"C-SIDE: Secure Software Development",
  "description":["The goal of Project C-SIDE is the development of a design methodology for software development that integrates non-technical aspects of cyber security into the traditional technically led approach to ensure greater security from the start.", "The main focus of our project is to improve software security by introducing an integrated, inter-disciplinary methodology for software development. We will use the state-of-art and the state-of-practice knowledge from the Computer Science and Software Engineering domains, upon which we will build our methodology."],
  "img":"img/cside.png",
"link":"https://www.projectcside.nl/"},  
  {"topic":"Mobile Security",
  "description":["Work on Android security, focusing on analysis and detection of malicious apps, improving automated testing, and evaluating security analysis tools; also explainable AI methods applied to malware detection."],
  "img":"https://via.placeholder.com/700x300"},
  {"topic":"Explainable Malware Detection",
  "description":["he deluge of malicious application samples requires adoption of automated, AI-based techniques to detect malware. However, for practitioners it is not enough that a sample is labelled as malicious: they need to understand the reasons behind this classification decision. In our group, we investigate how different Explainable AI (XAI) techniques fare when applied for (mobile) malware detection. We research domain-specific requirements that security analysts have concerning malware detection methods and compare different XAI techniques based on these requirements."],
  "img":"https://via.placeholder.com/700x300"}
]